[{"Name":"Luis Garavito","Country":"Colombia Ecuador[3] Venezuela[3]","Years active":"1992 to 1999[3]","Proven victims":193,"Possible victims":"193–300+","Notes":"Child-murderer, torture-killer, and rapist known as \"La Bestia\" (\"The Beast\"). Confessed to killing 140 boys between six and sixteen years old from October 1992 to April 1999 in Colombia and neighboring countries.[3] He is suspected of murdering over 300 victims, mostly street children. Garavito was originally sentenced to 1,853 years in prison, but this was later reduced to 22 years after he led police to many of the bodies of his victims.[4][5] He is scheduled to become eligible for parole in 2023.[6]"},{"Name":"Pedro López","Country":"Colombia Peru Ecuador","Years active":"1969 to 1980","Proven victims":110,"Possible victims":"300+","Notes":"Child-murderer and rapist, known as \"The Monster of the Andes\". Targeted young girls, between the ages of eight and twelve. Arrested in 1980 and convicted in 1983 of killing three young girls, but claimed to have killed hundreds. Despite being believed to be one of the most prolific serial killers of the twentieth century, he was released in the late 1990s.[7]"},{"Name":"Javed Iqbal","Country":"Pakistan","Years active":"1998 to 1999","Proven victims":100,"Possible victims":100,"Notes":"Child-murderer and rapist, known as \"Kukri\", Iqbal murdered 100 street children by strangling them and covering up his crimes by dissolving the bodies with acid. He was arrested in 1999 after sending a letter to a newspaper, and was set to be executed in the manner described by the judge who stated, \"You will be strangled to death in front of the parents whose children you killed, Your body will then be cut into 100 pieces and put in acid, the same way you killed the children.\"[8] However, he died in custody before he could be executed.[9]"},{"Name":"Mikhail Popkov","Country":"Russia","Years active":"1992 to 2010","Proven victims":78,"Possible victims":"83+","Notes":"Serial rapist-killer nicknamed \"The Werewolf\", who was active for two decades in Angarsk, Irkutsk and Vladivostok. After being convicted of 22 murders in 2015, he confessed to an additional 59 murders, of which he was convicted of 56 in 2018.[10][11] In July 2020, Popkov confessed to more killings, bringing the total number of admitted victims to 83.[12] Sentenced to life."},{"Name":"Daniel Camargo Barbosa","Country":"Colombia Ecuador Brazil (alleged)[13]","Years active":"1974 to 1986","Proven victims":72,"Possible victims":"180[13]","Notes":"Child and woman murderer, believed to have possibly raped and killed over 150 victims, primarily targeting female children as they were more likely to be virgins. Confessed to killing 72 victims. He strangled young girls in Colombia and was arrested, but he escaped from prison and he started killing in Ecuador; rearrested in 1986, he was incarcerated in the same Ecuadorian prison as 300+ serial killer Pedro López.[citation needed]  Camargo was killed in jail by the nephew of one of his victims.[13][14]"},{"Name":"Pedro Rodrigues Filho","Country":"Brazil","Years active":"1967 to 2003","Proven victims":71,"Possible victims":"100+","Notes":"He claimed to have killed over 100 victims, 47 of them inmates. He also killed his father and ate a piece of his heart. He killed his first two victims at the age of 14; he was first arrested in 1973. Convicted and sentenced to 128 years, but the maximum one can serve in Brazil is 30 years.[15] He was released in 2018."},{"Name":"Kampatimar Shankariya","Country":"India","Years active":"1977 to 1978","Proven victims":70,"Possible victims":"70+","Notes":"Indian serial killer who used a hammer to kill over 70 men and women between 1978 and 1979. He was hanged in 1979; his last words were, \"I have murdered in vain\", he declared. \"Nobody should become like me.\".[16][17][18][19]"},{"Name":"Yang Xinhai","Country":"China","Years active":"1999 to 2003","Proven victims":67,"Possible victims":67,"Notes":"Known as the \"Monster Killer\". Would enter victims' homes at night and kill using axes, meat cleavers, hammers, and shovels. Executed by gunshot in 2004.[20]"},{"Name":"Samuel Little","Country":"United States","Years active":"1970 to 2005","Proven victims":60,"Possible victims":93,"Notes":"Was convicted of killing three women, but later investigations linked 31 other murders to him. Little is now thought to be America's most prolific serial killer. He claimed he killed as many as 93 victims total, three above his initial confession of 90; the FBI later confirmed a total of 60 murders linked to Little. The investigations into his crimes are ongoing.[21][22]"},{"Name":"Andrei Chikatilo","Country":"Soviet Union","Years active":"1978 to 1990","Proven victims":53,"Possible victims":56,"Notes":"Known as \"The Butcher of Rostov\", \"The Red Ripper\" or \"The Rostov Ripper\". Convicted of the murder of 53 women and children between 1978 and 1990. One man was previously convicted and executed for his first murder. Executed by gunshot in 1994.[23]"},{"Name":"Anatoly Onoprienko","Country":"Soviet Union Ukraine","Years active":"1989 to 1996","Proven victims":52,"Possible victims":"52+","Notes":"Known as \"The Beast of Ukraine\", \"The Terminator\" and \"Citizen O\". Convicted of the murders of nine people in 1989 and 43 people in 1995–1996. Traveled throughout Europe illegally from 1990 to 1995; whether he killed during this time is unknown. Sentenced to death, later commuted to imprisonment for life. Died from heart failure in 2013.[23]"},{"Name":"Ivan Maleshoff","Country":"Soviet Union","Years active":"1934 to 1935","Proven victims":50,"Possible victims":50,"Notes":"Known as, \"Bluebeard of Kharkiv\"; Ivan Stepanovich Maleshoff was an electrical engineer and prolific albeit little known Soviet serial killer. He is purported to have killed 20 women in Kharkiv over a period of several months in 1935 with a knife, leaving behind little clues as to his identity other than taunting letters to police. Reportedly, apprehended by authorities as he attempted to kill his next victim, completely unaware he had been tailed after seen fleeing arrest by an undercover female officer earlier in the day. Prior to his execution, he confessed to an additional 30 murders in nearby Kyiv in 1934. He was convicted and executed in 1935 by firing squad at the age of 40.[24][25]"},{"Name":"Florisvaldo de Oliveira","Country":"Brazil","Years active":"1982 to 1983","Proven victims":50,"Possible victims":"50+","Notes":"Known as \"Cabo Bruno\"; former police officer and vigilante who murdered criminals in the outskirts of São Paulo; murdered by unknown assailants in 2012.[26]"},{"Name":"Willy Pickton","Country":"Canada","Years active":"1983 to 2002","Proven victims":49,"Possible victims":49,"Notes":"Nicknamed \"The Butcher\"; Robert Pickton was a Canadian serial killer who killed 49 women and disposed of their bodies by feeding them to his pigs. He was convicted of only 6 murders but charged for his proven 26 victims. The remaining 20 charges were stayed or dropped. Sentenced to life."},{"Name":"Gary Ridgway","Country":"United States","Years active":"1982 to 2000","Proven victims":49,"Possible victims":"71–90+","Notes":"Truck painter who confessed to killing 71 women. Also known as The Green River Killer. He almost exclusively targeted sex workers from Seattle. Suspected of killing over 90 victims, confessed to 71, convicted of 49.[27] Sentenced to life without parole.[28]"},{"Name":"Alexander Pichushkin","Country":"Russia","Years active":"1992 to 2006","Proven victims":48,"Possible victims":60,"Notes":"Known as the Chessboard Killer. Convicted of murdering 48 victims and suspected of killing 60. Claimed to have murdered 62 people, because he did not know that two of his victims had survived; stated goal of becoming Russia's most prolific serial killer.[29] Sentenced to imprisonment for life."},{"Name":"Wang Qiang","Country":"China","Years active":"1995 to 2003","Proven victims":45,"Possible victims":"60+","Notes":"Killed 45 and raped 10 from 1995 to 2003.[30] Executed by firing squad in 2005."},{"Name":"Mohammed Bijeh","Country":"Iran","Years active":2004,"Proven victims":43,"Possible victims":43,"Notes":"Raped and killed at least 41 boys and teenagers. Nicknamed the \"Tehran Desert Vampire\". Was convicted and executed after being lashed in front of a crowd in 2005.[31]"},{"Name":"Ahmad Suradji","Country":"Indonesia","Years active":"1986 to 1997","Proven victims":42,"Possible victims":"70–80+","Notes":"Convicted of strangling at least 42 women and girls in a series of ritual slayings he believed would give him magical powers. Executed by firing squad in 2008.[32]"},{"Name":"Raman Raghav","Country":"India","Years active":"1965 to 1968","Proven victims":41,"Possible victims":41,"Notes":"In the late 1960s, went on a violent rampage in Mumbai, India. Bludgeoned 41 people to death inside their huts while they slept. Died of kidney failure in 1995."},{"Name":"Tiago Henrique Gomes da Rocha","Country":"Brazil","Years active":"2011 to 2014","Proven victims":39,"Possible victims":"~39","Notes":"Brazilian security guard who confessed to the murders of 39 people. Attempted suicide in prison. Sentenced to 25 years.[33]"},{"Name":"Moses Sithole","Country":"South Africa","Years active":"1994 to 1995","Proven victims":38,"Possible victims":76,"Notes":"Known as South Africa's Ted Bundy. Preyed on unemployed women, posing as a businessman and luring his victims with the prospects of a job, before leading them to an isolated place, where he raped, tortured, and murdered them. Sentenced to 2410 years imprisonment with a non-parole period of 930 years.[34]"},{"Name":"Serhiy Tkach","Country":"Soviet Union Ukraine","Years active":"1984 to 2005","Proven victims":36,"Possible victims":"80–100","Notes":"A former Ukrainian police criminal investigator, suffocated girls aged between eight and 18 and performed sexual acts on their bodies after they were dead. Claims to have killed 100. Sentenced to imprisonment for life. Died from heart failure in 2018.[35]"},{"Name":"Gennady Mikhasevich","Country":"Soviet Union","Years active":"1971 to 1985","Proven victims":36,"Possible victims":"43–55+","Notes":"Strangled women. Besides killing, he also robbed his victims of money and valuable items (that he would sometimes give to his wife as a gift). Executed by firing squad in 1987.[36]"},{"Name":"Hadj Mohammed Mesfewi","Country":"Morocco","Years active":"1906 and earlier","Proven victims":36,"Possible victims":"36+","Notes":"Known as \"Marrakesh Arch-Killer\"; drugged, mutilated and murdered women; executed by immurement (walling) 1906."},{"Name":"Vera Renczi","Country":"Kingdom of Romania  Yugoslavia Hungary (alleged)","Years active":"1920 to 1930","Proven victims":35,"Possible victims":"~35","Notes":"Romanian serial killer nicknamed, \"The Black Widow\" convicted of killing 35 men through arsenic poisoning but confessed to only killing 32 victims. Renczi is one of the world's most prolific female serial killers. However, there is very little information about Renczi and her crimes because personal information (criminal history, academic records, etc.) were not cataloged as well as they are today, making some criminologists believe she was a figure of Romanian folklore rather than an actual person.[37]"},{"Name":"Ted Bundy","Country":"United States","Years active":"1974 to 1978","Proven victims":35,"Possible victims":"36–100+","Notes":"American serial killer known for his charisma and good looks. Bundy officially confessed to 30 homicides, but had confessed to killing 35–36 women in the past, and some estimates run upwards of 100 or more. Infamous for escaping from prison twice and murdering multiple victims in one day; sometimes abducting women from the same location within hours of one another.[38] He was executed by electric chair in 1989.[39][40]"},{"Name":"Clementine Barnabet","Country":"United States","Years active":1911,"Proven victims":35,"Possible victims":35,"Notes":"An axe murdering voodoo priestess who murdered African-American families at nighttime.[41] She was released in 1923."},{"Name":"John Wayne Gacy","Country":"United States","Years active":"1972 to 1978","Proven victims":33,"Possible victims":"34+","Notes":"Known to have murdered a minimum of 33 teenage boys and young men between 1972 and 1978, 26 of whom he buried in the crawl space of his Chicago home. Gacy was known as the \"Killer Clown\" due to the fact he often entertained children at social events dressed in a self devised clown costume. Executed by lethal injection in 1994.[42]"},{"Name":"Ali Asghar Borujerdi","Country":"Ottoman Empire Iraq Iran","Years active":"1907 to 1934","Proven victims":33,"Possible victims":33,"Notes":"Known as \"Asghar the Murderer\". Killed 33 young adults in Iraq and Iran. Executed by hanging in 1934.[43]"},{"Name":"Vasili Komaroff","Country":"Soviet Union","Years active":"1921 to 1923","Proven victims":33,"Possible victims":33,"Notes":"Known as \"The Wolf of Moscow\"; horse trader who killed 33 men. Executed by firing squad in 1923."},{"Name":"Fernando Hernández Leyva","Country":"Mexico","Years active":"1982 to 1999","Proven victims":33,"Possible victims":"100+","Notes":"Confessed to 100 murders and six kidnappings at the time of his arrest in 1999 (he had been arrested previously in 1982 and 1986, the second time for murder, but escaped from prison), but later retracted and claimed that he had been beaten by the police and his family threatened in order to force him to confess. Accused of as many as 137 murders in five southern Mexican states, convicted of 33 murders and sentenced 50 years in prison. Tried unsuccessfully to kill himself in prison. If his claim of 100+ victims were true then Leyva would be Mexico's most prolific documented serial killer.[44]"},{"Name":"Ramadan Abdel Rehim Mansour","Country":"Egypt","Years active":"1999 to 2006","Proven victims":32,"Possible victims":"32+","Notes":"Gang leader known as al-Tourbini (\"The Express Train\"). Raped and tortured homeless children, mostly boys aged 10 to 14 years old, aboard the trains between Cairo, Alexandria, Qalyubia and Beni Sueif. The victims were usually thrown off the moving train when they were dead or in agony; other times they were thrown into the Nile or buried alive. Executed in 2010.[45]"},{"Name":"Radik Tagirov","Country":"Russia","Years active":"2011 to 2012","Proven victims":32,"Possible victims":32,"Notes":"Murdered elderly women in several Russian regions; Kazakhstani native Pavel Shayakhmetov, found guilty of killing two elderly women in Samara, was arrested on suspicion of committing these murders.[46]"},{"Name":null}]